__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, None, None, 1 0                                            
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, None, None, 3 320         input_1[0][0]                    
__________________________________________________________________________________________________
activation_1 (Activation)       (None, None, None, 3 0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, None, None, 3 9248        activation_1[0][0]               
__________________________________________________________________________________________________
activation_2 (Activation)       (None, None, None, 3 0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, None, None, 3 9248        activation_2[0][0]               
__________________________________________________________________________________________________
activation_3 (Activation)       (None, None, None, 3 0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, None, None, 3 0           activation_3[0][0]               
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, None, None, 6 18496       max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
activation_4 (Activation)       (None, None, None, 6 0           conv2d_4[0][0]                   
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, None, None, 6 36928       activation_4[0][0]               
__________________________________________________________________________________________________
activation_5 (Activation)       (None, None, None, 6 0           conv2d_5[0][0]                   
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, None, None, 6 36928       activation_5[0][0]               
__________________________________________________________________________________________________
activation_6 (Activation)       (None, None, None, 6 0           conv2d_6[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, None, None, 6 0           activation_6[0][0]               
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, None, None, 1 73856       max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
activation_7 (Activation)       (None, None, None, 1 0           conv2d_7[0][0]                   
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, None, None, 1 147584      activation_7[0][0]               
__________________________________________________________________________________________________
activation_8 (Activation)       (None, None, None, 1 0           conv2d_8[0][0]                   
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, None, None, 1 147584      activation_8[0][0]               
__________________________________________________________________________________________________
activation_9 (Activation)       (None, None, None, 1 0           conv2d_9[0][0]                   
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, None, None, 1 0           activation_9[0][0]               
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, None, None, 1 0           dropout_1[0][0]                  
__________________________________________________________________________________________________
conv2d_transpose_1 (Conv2DTrans (None, None, None, 1 65664       max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, None, None, 2 0           conv2d_transpose_1[0][0]         
                                                                 dropout_1[0][0]                  
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, None, None, 1 295040      concatenate_1[0][0]              
__________________________________________________________________________________________________
activation_13 (Activation)      (None, None, None, 1 0           conv2d_13[0][0]                  
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, None, None, 1 147584      activation_13[0][0]              
__________________________________________________________________________________________________
activation_14 (Activation)      (None, None, None, 1 0           conv2d_14[0][0]                  
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, None, None, 1 147584      activation_14[0][0]              
__________________________________________________________________________________________________
activation_15 (Activation)      (None, None, None, 1 0           conv2d_15[0][0]                  
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, None, None, 1 0           activation_15[0][0]              
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, None, None, 1 0           dropout_3[0][0]                  
__________________________________________________________________________________________________
conv2d_transpose_2 (Conv2DTrans (None, None, None, 6 32832       dropout_4[0][0]                  
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, None, None, 1 0           conv2d_transpose_2[0][0]         
                                                                 activation_6[0][0]               
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, None, None, 6 73792       concatenate_2[0][0]              
__________________________________________________________________________________________________
activation_16 (Activation)      (None, None, None, 6 0           conv2d_16[0][0]                  
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, None, None, 6 36928       activation_16[0][0]              
__________________________________________________________________________________________________
activation_17 (Activation)      (None, None, None, 6 0           conv2d_17[0][0]                  
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, None, None, 6 36928       activation_17[0][0]              
__________________________________________________________________________________________________
activation_18 (Activation)      (None, None, None, 6 0           conv2d_18[0][0]                  
__________________________________________________________________________________________________
conv2d_transpose_3 (Conv2DTrans (None, None, None, 3 8224        activation_18[0][0]              
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, None, None, 6 0           conv2d_transpose_3[0][0]         
                                                                 activation_3[0][0]               
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, None, None, 3 18464       concatenate_3[0][0]              
__________________________________________________________________________________________________
activation_19 (Activation)      (None, None, None, 3 0           conv2d_19[0][0]                  
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, None, None, 3 9248        activation_19[0][0]              
__________________________________________________________________________________________________
activation_20 (Activation)      (None, None, None, 3 0           conv2d_20[0][0]                  
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, None, None, 3 9248        activation_20[0][0]              
__________________________________________________________________________________________________
activation_21 (Activation)      (None, None, None, 3 0           conv2d_21[0][0]                  
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, None, None, 1 33          activation_21[0][0]              
==================================================================================================
Total params: 1,361,761
Trainable params: 1,361,761
Non-trainable params: 0
__________________________________________________________________________________________________
